[{"research_paper":{"title":"Sample Title 2","content":"Sample Content 2","abstract":"Sample Abstract 2","file":"file_path_2","date_publish":"2022-02-02","authors":[{"name":"Morales, Sheryl R."}]}},{"research_paper":{"title":"Sample Title 3","content":"Sample Content 3","abstract":"Sample Abstract 3","file":"file_path_3","date_publish":"2022-03-03","authors":[{"name":"Balatbat, Christian O."}]}},{"research_paper":{"title":"Sample Title 1","content":"Sample Content 1","abstract":"Sample Abstract 1","file":"file_path_1","date_publish":"2022-01-01","authors":[{"name":"Monzon, Demelyn E."}]}},{"research_paper":{"title":"test copyright 2/10","content":"<p>test</p>","abstract":"<p>test</p>","file":"https://ik.imagekit.io/0x1lnkvjw/BudgetBud_-_Training_Plan_LgVgNUeXG_X0oB6nHEhWD.pdf","date_publish":"2024-02-10","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Exploring Advanced Machine Learning Techniques","content":"This paper delves into advanced machine learning techniques and their applications in real-world scenarios.","abstract":"A comprehensive exploration of cutting-edge machine learning methods and their practical implications.","file":"/path/to/file1.pdf","date_publish":"2022-03-15","authors":[{"name":"Oliquino, Joanna Marie D."}]}},{"research_paper":{"title":"Blockchain Technology for Secure Transactions","content":"This research paper investigates the use of blockchain technology to enhance the security of digital transactions.","abstract":"Examining the role of blockchain in ensuring secure and transparent digital transactions.","file":"/path/to/file2.pdf","date_publish":"2022-05-22","authors":[{"name":"Dolorosa, Rodrigo S."}]}},{"research_paper":{"title":"Advancements in Quantum Computing","content":"This paper explores recent advancements in quantum computing and their potential impact on various industries.","abstract":"A detailed analysis of the latest developments in the field of quantum computing and their applications.","file":"/path/to/file3.pdf","date_publish":"2022-08-10","authors":[{"name":"Esparagoza, Cherrylyn P."}]}},{"research_paper":{"title":"The Role of AI in Healthcare","content":"Investigating how artificial intelligence is revolutionizing healthcare practices and improving patient outcomes.","abstract":"An in-depth study on the applications and impact of artificial intelligence in the healthcare sector.","file":"/path/to/file4.pdf","date_publish":"2022-07-05","authors":[{"name":"Doromal, Roberto B."}]}},{"research_paper":{"title":"Cybersecurity Threats in the 21st Century","content":"Examining the evolving landscape of cybersecurity threats and strategies to mitigate potential risks.","abstract":"An analysis of emerging cybersecurity threats and effective countermeasures in the modern era.","file":"/path/to/file5.pdf","date_publish":"2022-02-18","authors":[{"name":"Bulawit, Berna A."}]}},{"research_paper":{"title":"Smart Cities: Integration of IoT and Urban Planning","content":"Exploring the integration of Internet of Things (IoT) technologies in urban planning to create smart and sustainable cities.","abstract":"An investigation into the synergy between IoT and urban planning for the development of smart cities.","file":"/path/to/file6.pdf","date_publish":"2022-06-30","authors":[{"name":"Gatchalian, Irynne P."}]}},{"research_paper":{"title":"Ethical Considerations in Artificial Intelligence","content":"Addressing the ethical challenges associated with the deployment of artificial intelligence in various domains.","abstract":"A thorough examination of ethical considerations and guidelines for the responsible use of AI.","file":"/path/to/file7.pdf","date_publish":"2022-04-12","authors":[{"name":"Morales, Sheryl R."}]}},{"research_paper":{"title":"Climate Change Impact on Biodiversity","content":"Investigating the consequences of climate change on global biodiversity and proposing conservation strategies.","abstract":"An in-depth analysis of the impact of climate change on biodiversity and conservation measures.","file":"/path/to/file8.pdf","date_publish":"2022-09-15","authors":[{"name":"Smith, Jane ."}]}},{"research_paper":{"title":"Augmented Reality Applications in Education","content":"Exploring the use of augmented reality in educational settings and its potential to enhance learning experiences.","abstract":"A study on the integration of augmented reality for improved educational outcomes and engagement.","file":"/path/to/file9.pdf","date_publish":"2022-11-08","authors":[{"name":"Aquino, Rodolfo Y."}]}},{"research_paper":{"title":"The Future of Renewable Energy Technologies","content":"Examining the latest advancements in renewable energy technologies and their potential role in the future energy landscape.","abstract":"An overview of emerging renewable energy technologies and their implications for sustainable energy development.","file":"/path/to/file10.pdf","date_publish":"2022-10-20","authors":[{"name":"Bactasa, Melanie F."}]}},{"research_paper":{"title":"Advances in Explainable Artificial Intelligence","content":"This paper explores recent advancements in explainable artificial intelligence (XAI) and its applications in decision-making processes.","abstract":"An in-depth analysis of the latest techniques and tools in XAI and their implications for transparent and interpretable AI models.","file":"/path/to/file11.pdf","date_publish":"2023-03-15","authors":[{"name":"Oliquino, Joanna Marie D."}]}},{"research_paper":{"title":"Quantum Computing for Optimization Problems","content":"Investigating the use of quantum computing to solve complex optimization problems and its potential impact on various industries.","abstract":"An exploration of quantum computing algorithms for optimization tasks and their applications in real-world scenarios.","file":"/path/to/file12.pdf","date_publish":"2023-05-22","authors":[{"name":"Dolorosa, Rodrigo S."}]}},{"research_paper":{"title":"Biomedical Applications of Nanotechnology","content":"Examining the use of nanotechnology in biomedical applications, with a focus on drug delivery systems and diagnostics.","abstract":"A comprehensive review of nanotechnology advancements and their potential in revolutionizing biomedical research and healthcare.","file":"/path/to/file13.pdf","date_publish":"2023-08-10","authors":[{"name":"Esparagoza, Cherrylyn P."}]}},{"research_paper":{"title":"Robotic-Assisted Surgery in Neurology","content":"Investigating the use of robotic-assisted surgery techniques in neurology for enhanced precision and patient outcomes.","abstract":"An in-depth study on the applications of robotics in neurosurgical procedures and its impact on surgical outcomes.","file":"/path/to/file14.pdf","date_publish":"2023-07-05","authors":[{"name":"Doromal, Roberto B."}]}},{"research_paper":{"title":"Privacy-Preserving Machine Learning Techniques","content":"Examining privacy-preserving machine learning techniques to address concerns related to data privacy and security.","abstract":"An analysis of techniques for ensuring privacy in machine learning models and their implications for secure data processing.","file":"/path/to/file15.pdf","date_publish":"2023-02-18","authors":[{"name":"Bulawit, Berna A."}]}},{"research_paper":{"title":"Augmented Reality for Cultural Heritage Preservation","content":"Exploring the use of augmented reality in preserving and showcasing cultural heritage sites and artifacts.","abstract":"An investigation into the application of AR technologies for cultural heritage preservation and public engagement.","file":"/path/to/file16.pdf","date_publish":"2023-06-30","authors":[{"name":"Gatchalian, Irynne P."}]}},{"research_paper":{"title":"Ethical Considerations in AI-Based Decision Systems","content":"Addressing ethical challenges in the development and deployment of AI-based decision systems across various domains.","abstract":"A comprehensive study on ethical considerations and guidelines for responsible AI-based decision-making.","file":"/path/to/file17.pdf","date_publish":"2023-04-12","authors":[{"name":"Morales, Sheryl R."}]}},{"research_paper":{"title":"Urban Mobility Solutions: Integrating AI and Sustainability","content":"Investigating the integration of artificial intelligence in urban mobility systems for sustainable and efficient transportation.","abstract":"An in-depth analysis of AI-driven solutions for urban mobility and their impact on sustainability and transportation efficiency.","file":"/path/to/file18.pdf","date_publish":"2023-09-15","authors":[{"name":"Smith, Jane ."}]}},{"research_paper":{"title":"The Impact of Climate Change on Urban Heat Islands","content":"Examining the influence of climate change on the formation and intensification of urban heat islands and proposing mitigation strategies.","abstract":"An overview of the relationship between climate change and urban heat islands, along with strategies to alleviate their impact.","file":"/path/to/file19.pdf","date_publish":"2023-11-08","authors":[{"name":"Aquino, Rodolfo Y."}]}},{"research_paper":{"title":"Advancements in Energy Storage Technologies","content":"Examining the latest developments in energy storage technologies and their potential role in achieving sustainable and efficient energy systems.","abstract":"An overview of emerging energy storage technologies and their implications for sustainable energy production and consumption.","file":"/path/to/file20.pdf","date_publish":"2023-10-20","authors":[{"name":"Bactasa, Melanie F."}]}},{"research_paper":{"title":"Advancements in Natural Language Processing","content":"This paper explores recent advancements in natural language processing (NLP) and its applications in understanding and generating human-like text.","abstract":"An in-depth analysis of the latest techniques and models in NLP, with a focus on improving language understanding and generation.","file":"/path/to/file21.pdf","date_publish":"2024-01-15","authors":[{"name":"Oliquino, Joanna Marie D."}]}},{"research_paper":{"title":"Advances in Quantum Cryptography","content":"Investigating the use of quantum cryptography to secure communication channels and protect sensitive information from eavesdropping.","abstract":"An exploration of quantum cryptographic protocols and their applications for secure communication in the digital age.","file":"/path/to/file22.pdf","date_publish":"2024-01-22","authors":[{"name":"Dolorosa, Rodrigo S."}]}},{"research_paper":{"title":"Genome Editing Technologies: CRISPR-Cas9","content":"Examining the revolutionary CRISPR-Cas9 genome editing technology and its applications in genetic research and medical treatments.","abstract":"A comprehensive review of CRISPR-Cas9 technology and its potential for precise and targeted genetic modifications.","file":"/path/to/file23.pdf","date_publish":"2024-01-10","authors":[{"name":"Esparagoza, Cherrylyn P."}]}},{"research_paper":{"title":"Artificial General Intelligence: Challenges and Opportunities","content":"Investigating the challenges and opportunities in the development of artificial general intelligence (AGI) and its potential societal impact.","abstract":"An in-depth study on the current state of AGI research, challenges faced, and the potential societal implications of achieving AGI.","file":"/path/to/file24.pdf","date_publish":"2024-01-05","authors":[{"name":"Doromal, Roberto B."}]}},{"research_paper":{"title":"Blockchain and Supply Chain Transparency","content":"Examining the use of blockchain technology to enhance transparency and traceability in supply chain management.","abstract":"An analysis of blockchain-based solutions for supply chain transparency, ensuring trust and accountability.","file":"/path/to/file25.pdf","date_publish":"2024-01-18","authors":[{"name":"Bulawit, Berna A."}]}},{"research_paper":{"title":"Biometric Authentication: Trends and Security Implications","content":"Exploring the latest trends in biometric authentication technologies and evaluating their security implications in various applications.","abstract":"An investigation into the advancements in biometric authentication and the associated security challenges and solutions.","file":"/path/to/file26.pdf","date_publish":"2024-01-30","authors":[{"name":"Gatchalian, Irynne P."}]}},{"research_paper":{"title":"Ethical Considerations in AI-Based Autonomous Vehicles","content":"Addressing ethical challenges in the development and deployment of AI-based autonomous vehicles for safe and responsible transportation.","abstract":"A comprehensive study on ethical considerations and guidelines for responsible AI integration in autonomous vehicles.","file":"/path/to/file27.pdf","date_publish":"2024-01-12","authors":[{"name":"Morales, Sheryl R."}]}},{"research_paper":{"title":"Social Media Analytics for Public Opinion Understanding","content":"Investigating the use of social media analytics to understand public opinions and sentiment analysis for effective decision-making.","abstract":"An in-depth analysis of social media analytics techniques for public opinion understanding and decision support.","file":"/path/to/file28.pdf","date_publish":"2024-01-15","authors":[{"name":"Smith, Jane ."}]}},{"research_paper":{"title":"Renewable Energy Integration into Smart Grids","content":"Examining the integration of renewable energy sources into smart grids for efficient and sustainable electricity distribution.","abstract":"An overview of strategies and technologies for incorporating renewable energy into smart grids to enhance energy sustainability.","file":"/path/to/file29.pdf","date_publish":"2024-01-08","authors":[{"name":"Aquino, Rodolfo Y."}]}},{"research_paper":{"title":"Advancements in Water Purification Technologies","content":"Examining the latest developments in water purification technologies for ensuring clean and safe water access globally.","abstract":"An overview of emerging water purification technologies and their implications for addressing water scarcity and contamination.","file":"/path/to/file30.pdf","date_publish":"2024-01-20","authors":[{"name":"Bactasa, Melanie F."}]}},{"research_paper":{"title":"The Impact of Social Media on Mental Health","content":"Investigating the relationship between social media usage and mental health outcomes, analyzing both positive and negative impacts.","abstract":"A comprehensive study on how social media affects mental health, exploring potential interventions for mitigating negative consequences.","file":"/path/to/file31.pdf","date_publish":"2021-09-15","authors":[{"name":"Oliquino, Joanna Marie D."}]}},{"research_paper":{"title":"Advancements in Quantum Communication","content":"Exploring the latest developments in quantum communication protocols and their potential for secure and efficient information transfer.","abstract":"An in-depth analysis of quantum communication technologies, addressing challenges and potential applications in secure communication.","file":"/path/to/file32.pdf","date_publish":"2021-06-22","authors":[{"name":"Dolorosa, Rodrigo S."}]}},{"research_paper":{"title":"Applications of Artificial Intelligence in Agriculture","content":"Examining the use of artificial intelligence in precision farming, crop monitoring, and decision-making processes to enhance agricultural productivity.","abstract":"A detailed review of AI applications in agriculture, discussing benefits, challenges, and potential future developments.","file":"/path/to/file33.pdf","date_publish":"2021-03-10","authors":[{"name":"Esparagoza, Cherrylyn P."}]}},{"research_paper":{"title":"Cybersecurity in Healthcare: Challenges and Solutions","content":"Investigating the challenges faced by the healthcare sector in ensuring cybersecurity and proposing effective solutions for safeguarding patient data.","abstract":"An in-depth analysis of cybersecurity issues in healthcare, offering strategies and technologies for enhanced data protection.","file":"/path/to/file34.pdf","date_publish":"2021-12-05","authors":[{"name":"Doromal, Roberto B."}]}},{"research_paper":{"title":"Blockchain and Digital Identity Management","content":"Examining the use of blockchain technology for secure and decentralized digital identity management, addressing issues of privacy and security.","abstract":"An analysis of blockchain-based solutions for digital identity, exploring their potential in enhancing security and user control.","file":"/path/to/file35.pdf","date_publish":"2021-04-18","authors":[{"name":"Bulawit, Berna A."}]}},{"research_paper":{"title":"Smart Cities: Sustainable Urban Development","content":"Exploring the integration of smart technologies in urban planning to create sustainable and efficient cities with improved quality of life.","abstract":"An investigation into the role of smart technologies in promoting sustainable urban development and addressing urban challenges.","file":"/path/to/file36.pdf","date_publish":"2021-01-30","authors":[{"name":"Gatchalian, Irynne P."}]}},{"research_paper":{"title":"Ethical Considerations in Autonomous Vehicles","content":"Addressing ethical challenges in the development and deployment of autonomous vehicles, focusing on safety, decision-making, and societal impact.","abstract":"A comprehensive study on ethical considerations and guidelines for the responsible integration of autonomous vehicles into society.","file":"/path/to/file37.pdf","date_publish":"2021-07-12","authors":[{"name":"Morales, Sheryl R."}]}},{"research_paper":{"title":"Digital Learning Environments: Pedagogical Impacts","content":"Investigating the impact of digital learning environments on pedagogy and student learning outcomes, exploring both challenges and opportunities.","abstract":"An in-depth analysis of how digital learning environments shape pedagogical practices and influence student engagement and achievement.","file":"/path/to/file38.pdf","date_publish":"2021-11-15","authors":[{"name":"Smith, Jane ."}]}},{"research_paper":{"title":"Renewable Energy in Developing Countries","content":"Examining the challenges and opportunities of implementing renewable energy solutions in developing countries for sustainable development.","abstract":"An overview of the socio-economic and environmental implications of renewable energy adoption in the context of developing nations.","file":"/path/to/file39.pdf","date_publish":"2021-09-08","authors":[{"name":"Aquino, Rodolfo Y."}]}},{"research_paper":{"title":"Advancements in Medical Imaging Technologies","content":"Examining the latest developments in medical imaging technologies, including advancements in diagnostic accuracy and patient care.","abstract":"An overview of emerging medical imaging technologies and their implications for improved diagnosis and treatment in healthcare.","file":"/path/to/file40.pdf","date_publish":"2021-02-20","authors":[{"name":"Bactasa, Melanie F."}]}},{"research_paper":{"title":"Human-Computer Interaction in Virtual Reality Environments","content":"Investigating the user experience and interaction design principles in virtual reality (VR) environments for various applications.","abstract":"An in-depth study on the challenges and opportunities in human-computer interaction within VR settings and its impact on user engagement.","file":"/path/to/file41.pdf","date_publish":"2021-03-15","authors":[{"name":"Abalos, Karl Christian D."}]}},{"research_paper":{"title":"Impact of 5G Technology on Internet of Things (IoT)","content":"Examining the transformative impact of 5G networks on the scalability, connectivity, and performance of IoT devices and applications.","abstract":"A comprehensive review of the synergies between 5G technology and IoT, exploring potential applications and challenges in the evolving landscape.","file":"/path/to/file42.pdf","date_publish":"2021-05-22","authors":[{"name":"Bernardino, Girlie F."}]}},{"research_paper":{"title":"Educational Technology Adoption in Remote Learning","content":"Investigating the adoption and impact of educational technology tools in remote learning environments, addressing challenges and best practices.","abstract":"An in-depth analysis of the role of technology in remote education, exploring its potential benefits and implications for student learning outcomes.","file":"/path/to/file43.pdf","date_publish":"2021-08-10","authors":[{"name":"Calingasan, Francisco S."}]}},{"research_paper":{"title":"Digital Transformation in the Banking Sector","content":"Examining the strategies and challenges of digital transformation initiatives in the banking industry, focusing on customer experience and security.","abstract":"An analysis of the impact of digital transformation on banking operations, customer interactions, and the overall financial ecosystem.","file":"/path/to/file44.pdf","date_publish":"2021-07-05","authors":[{"name":"Castillo, Eleazar E."}]}},{"research_paper":{"title":"Biological Data Storage: DNA as a Storage Medium","content":"Exploring the use of DNA as a potential data storage medium, analyzing its capacity, durability, and implications for future data storage solutions.","abstract":"An investigation into the feasibility and challenges of biological data storage using DNA, with a focus on long-term archival and security.","file":"/path/to/file45.pdf","date_publish":"2021-02-18","authors":[{"name":"Caturay, Norberto V."}]}},{"research_paper":{"title":"E-Learning Accessibility for Diverse Learners","content":"Addressing the accessibility challenges in e-learning platforms for diverse learners, including those with disabilities and different learning styles.","abstract":"A comprehensive study on designing inclusive e-learning environments, ensuring accessibility and equal educational opportunities for all.","file":"/path/to/file46.pdf","date_publish":"2021-06-30","authors":[{"name":"Cecogo, Nieva M."}]}},{"research_paper":{"title":"AI in Healthcare: Diagnosing and Predicting Diseases","content":"Examining the use of artificial intelligence for disease diagnosis and prediction in healthcare, with a focus on improving patient outcomes.","abstract":"An overview of AI applications in healthcare, discussing challenges and opportunities in implementing AI-driven diagnostic and predictive models.","file":"/path/to/file47.pdf","date_publish":"2021-04-12","authors":[{"name":"Cipriano, Erwin S."}]}},{"research_paper":{"title":"Blockchain-Based Voting Systems: Ensuring Election Integrity","content":"Addressing the challenges and benefits of implementing blockchain-based voting systems for secure, transparent, and tamper-resistant elections.","abstract":"An analysis of how blockchain technology can enhance the integrity of electoral processes, ensuring trust and accountability in voting systems.","file":"/path/to/file48.pdf","date_publish":"2021-09-15","authors":[{"name":"Clenuar, Ricardo H."}]}},{"research_paper":{"title":"The Future of Augmented Reality in Education","content":"Investigating the potential applications and impact of augmented reality (AR) in educational settings, enhancing learning experiences for students.","abstract":"An in-depth study on the integration of AR technologies into education, exploring innovative approaches to improve student engagement and understanding.","file":"/path/to/file49.pdf","date_publish":"2021-11-08","authors":[{"name":"Domingo, Keinaz ."}]}},{"research_paper":{"title":"Sustainable Transportation: Role of Electric Vehicles","content":"Examining the role of electric vehicles (EVs) in achieving sustainable transportation, addressing environmental and economic considerations.","abstract":"An overview of the challenges and opportunities in adopting EVs for sustainable transportation, discussing the impact on energy consumption and emissions.","file":"/path/to/file50.pdf","date_publish":"2021-03-20","authors":[{"name":"Doromal, Cherry M."}]}},{"research_paper":{"title":"Quantum Computing: Recent Developments and Challenges","content":"Exploring the latest advancements in quantum computing and addressing the challenges in achieving scalable and error-resistant quantum computation.","abstract":"A comprehensive review of recent developments in quantum computing, discussing breakthroughs and current challenges in the field.","file":"/path/to/file51.pdf","date_publish":"2022-04-15","authors":[{"name":"Johnson, Robert ."}]}},{"research_paper":{"title":"Applications of Machine Learning in Predictive Maintenance","content":"Examining the use of machine learning algorithms for predictive maintenance in various industries, enhancing equipment reliability and efficiency.","abstract":"An in-depth study on the applications and benefits of machine learning in predictive maintenance, optimizing maintenance schedules and reducing downtime.","file":"/path/to/file52.pdf","date_publish":"2022-07-22","authors":[{"name":"Avena, Ian E."}]}},{"research_paper":{"title":"Bioinformatics: Advances in Computational Biology","content":"Investigating the latest advances in bioinformatics and computational biology, focusing on the analysis and interpretation of biological data.","abstract":"A comprehensive review of computational methods and tools in bioinformatics, discussing their applications in genomics, proteomics, and more.","file":"/path/to/file53.pdf","date_publish":"2022-10-10","authors":[{"name":"Monzon, Demelyn E."}]}},{"research_paper":{"title":"Ethical Considerations in Artificial Intelligence Research","content":"Addressing ethical challenges in AI research, discussing responsible practices, and proposing guidelines for ethical AI development and deployment.","abstract":"An analysis of ethical considerations in AI research, emphasizing the importance of transparency, fairness, and accountability in AI systems.","file":"/path/to/file54.pdf","date_publish":"2022-05-05","authors":[{"name":"Balatbat, Christian O."}]}},{"research_paper":{"title":"4624","content":"<p>test</p>","abstract":"<p>test</p>","file":"https://ik.imagekit.io/xtafra0hu/Medix_Branding__For_Approval__y4pVngB4z.pdf","date_publish":"2024-04-15","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Climate Change Mitigation: Role of Renewable Energy","content":"Examining the contribution of renewable energy sources in mitigating the impact of climate change, focusing on sustainable energy solutions.","abstract":"An overview of the role of renewable energy in addressing climate change, discussing strategies for reducing carbon emissions and promoting sustainability.","file":"/path/to/file55.pdf","date_publish":"2022-08-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Augmented Reality in Healthcare: Enhancing Medical Training","content":"Investigating the applications of augmented reality in medical training, exploring its potential to improve learning outcomes for healthcare professionals.","abstract":"An in-depth study on the use of augmented reality for medical training, discussing its advantages and challenges in enhancing practical skills.","file":"/path/to/file56.pdf","date_publish":"2022-03-30","authors":[{"name":"Oliquino, Joanna Marie D."}]}},{"research_paper":{"title":"Digital Twins: Applications in Industry 4.0","content":"Examining the use of digital twins in Industry 4.0, discussing their applications in predictive maintenance, process optimization, and more.","abstract":"A comprehensive review of digital twins in the context of Industry 4.0, exploring their role in improving efficiency and decision-making in manufacturing.","file":"/path/to/file57.pdf","date_publish":"2022-06-12","authors":[{"name":"Dolorosa, Rodrigo S."}]}},{"research_paper":{"title":"Urban Agriculture: Sustainable Food Production in Cities","content":"Investigating the concept of urban agriculture and its role in sustainable food production, addressing challenges and opportunities in urban settings.","abstract":"An in-depth study on the practices and benefits of urban agriculture, discussing its potential to contribute to food security and environmental sustainability.","file":"/path/to/file58.pdf","date_publish":"2022-01-15","authors":[{"name":"Bernardino, Girlie F."}]}},{"research_paper":{"title":"Human Augmentation Technologies: Ethical and Social Implications","content":"Addressing the ethical and social implications of human augmentation technologies, discussing concerns and proposing guidelines for responsible development.","abstract":"An analysis of the impact of human augmentation technologies on society, emphasizing ethical considerations and the need for responsible implementation.","file":"/path/to/file59.pdf","date_publish":"2022-11-08","authors":[{"name":"Calingasan, Francisco S."}]}},{"research_paper":{"title":"Cryptocurrency and Financial Inclusion","content":"Examining the role of cryptocurrency in promoting financial inclusion, discussing opportunities and challenges in expanding access to financial services.","abstract":"An overview of the impact of cryptocurrency on financial inclusion, exploring its potential to empower individuals with limited access to traditional banking.","file":"/path/to/file60.pdf","date_publish":"2022-02-20","authors":[{"name":"Castillo, Eleazar E."}]}},{"research_paper":{"title":"Neurotechnology: Advances in Brain-Computer Interfaces","content":"Investigating recent advances in neurotechnology, specifically in the development of brain-computer interfaces (BCIs) for various applications.","abstract":"A comprehensive review of the latest developments in neurotechnology, focusing on the applications and potential impact of brain-computer interfaces.","file":"/path/to/file61.pdf","date_publish":"2023-04-15","authors":[{"name":"Cecogo, Nieva M."}]}},{"research_paper":{"title":"Circular Economy: Sustainable Business Practices","content":"Examining the principles and practices of circular economy, focusing on sustainable business models and their impact on environmental conservation.","abstract":"An in-depth study on the implementation of circular economy principles in business, discussing challenges and opportunities for sustainable practices.","file":"/path/to/file62.pdf","date_publish":"2023-07-22","authors":[{"name":"Cipriano, Erwin S."}]}},{"research_paper":{"title":"Advanced Robotics in Manufacturing: Automation Trends","content":"Investigating the latest trends in advanced robotics for manufacturing, analyzing the impact of automation on production efficiency and quality.","abstract":"A comprehensive review of advanced robotics applications in manufacturing, exploring the adoption of automation trends and their implications.","file":"/path/to/file63.pdf","date_publish":"2023-10-10","authors":[{"name":"Clenuar, Ricardo H."}]}},{"research_paper":{"title":"Blockchain in Supply Chain Management","content":"Examining the use of blockchain technology in supply chain management, addressing issues of transparency, traceability, and efficiency.","abstract":"An analysis of how blockchain can enhance the transparency and efficiency of supply chain processes, with a focus on real-world applications.","file":"/path/to/file64.pdf","date_publish":"2023-05-05","authors":[{"name":"Domingo, Keinaz ."}]}},{"research_paper":{"title":"Advancements in Personalized Medicine","content":"Investigating recent advancements in personalized medicine, including genomics, biomarker discovery, and targeted therapeutic interventions.","abstract":"A comprehensive review of personalized medicine technologies, discussing their applications in diagnosis, treatment, and disease prevention.","file":"/path/to/file65.pdf","date_publish":"2023-03-30","authors":[{"name":"Doromal, Cherry M."}]}},{"research_paper":{"title":"Advancements in Quantum Cryptography","content":"Exploring recent developments in quantum cryptography, addressing challenges and potential applications in secure communication.","abstract":"A comprehensive review of quantum cryptographic techniques, discussing advancements and their implications for secure communication.","file":"/path/to/file66.pdf","date_publish":"2022-04-15","authors":[{"name":"Oliquino, Joanna Marie D."}]}},{"research_paper":{"title":"AI-driven Personalized Learning Platforms","content":"Examining the integration of artificial intelligence in personalized learning platforms, enhancing adaptability and engagement for students.","abstract":"An in-depth analysis of AI-powered personalized learning, exploring the benefits and challenges in tailoring education to individual student needs.","file":"/path/to/file67.pdf","date_publish":"2022-07-22","authors":[{"name":"Dolorosa, Rodrigo S."}]}},{"research_paper":{"title":"Medical Center Clinic Appointment System","content":"<p>-</p>","abstract":"<p>MEDICAL CENTER FAITH HOPE LOVE CLINIC tracks and manages all aspects of the appointment process, including appointment module, online selling module, and chatting module. Most hospitals did this by manual, putting the organization's technology capabilities far below the baseline digital standards that a healthcare institution must satisfy. The system is used to aid clinics, customers, and staff in handling appointments in the clinic.<br><br>The Medical Center Clinic Appointment System disentangles the booking process of customer appointments. It provides a smoother flow of systematic process in entertaining customers with their clinical needs. Moreover, with the growing trend of online shopping, Medical Center Clinic Appointment System also has an online shopping module that will help customers view and buy products from the website which may be picked-up on their next visit to the clinic. Furthermore, the system has a chat bot feature where customers can ask frequently asked questions. They may also opt to message a live-representative if customers have more questions. This feature is vital for the business process since it will simplify customer service.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_PY0Qg5IgoAV.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Faith Hope Love Clinic: Medical Center Clinic Appointment System","content":"<p>-</p>","abstract":"<p>The Medical Center Clinic Appointment System is a program developed to assist the Faith, Hope, Love Clinic in managing their online appointments and different transactions regarding the clinic. This will serve as the portal of the clinic to their possible clients who tend to make a reservation at their clinic for possible consultations and operations. There is also a marketplace module that the system offers for clients who tend to purchase products from the clinic. The payment method regarding this module will only be available via pick-up in the clinic itself. There is also a function on the website that caters to users’ questions and inquiries regarding specific questions and frequently asked questions (FAQs). The system also accepts canceling of appointments and re-booking of appointments if deemed necessary.<br><br>The purpose of maximizing the functionality of the system’s offered services is to enhance the clinic’s overall workforce, efficiency in handling customers’ appointments, and establish a long-term operational website that will be proved beneficial for the clinic.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_BoK9iee0Z.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"SOAR Human Resources Management System","content":"<p>-</p>","abstract":"<p>Manual HR practices are still extensively used at many businesses despite being an old method with many problems. In today's market, which is dominated by digital technology, juggling paper forms, fighting with Excel spreadsheets, and sifting through numerous hard copy files to find critical documents is becoming obsolete.<br><br>The SOAR Human Resources Management System includes all of the multiple tools required by firms to manage standard Human Resources operations, such as hiring, onboarding, payroll, time and attendance, performance management, and succession planning. Its goal is to streamline and focus crucial human resources duties for more efficient administration. This translates into practical benefits including faster training, synchronized, real-time data sharing, speedier processing times, manageable maintenance, and the ability to scale up to meet future needs.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_2cB26ldgf.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Government Financial Management Innovators Circle, Incorporation Web Portal Administrative Access Module (AAM)","content":"<p>-</p>","abstract":"<p>The GFMIC, Inc. Web-based System Portal development project information is contained in this report. Formerly known as EUC, GFMIC, Inc. is a professional non-stock and non-profit company that offers financial management information systems. For users of the eNGAS and e-Budget systems, they offered a membership program. ICT is a tool used by the present Government Financial Management Information Center (GFMIC, Inc.) to modernize its operations. In this project, their association needs a web portal to serve as a conduit for communication with clients and a resource for staff members. The developed system portal has the following modules: event management system, membership, account registration, and eCertificate production. This paper contains a majority of the techniques that the project team used to produce the product. For the clients' upcoming tasks to be completed, more development was required. This paper states that some of the following system requirements were unsatisfied as a result of unanticipated events the development team encountered during the phases of development.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_J9HXd3HCy.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"The Role of Blockchain in Securing IoT Networks","content":"Investigating the use of blockchain technology to enhance security in Internet of Things (IoT) networks, addressing vulnerabilities and ensuring trust.","abstract":"An overview of blockchain applications for securing IoT ecosystems, discussing challenges and opportunities in mitigating cybersecurity threats.","file":"/path/to/file68.pdf","date_publish":"2022-10-10","authors":[{"name":"Esparagoza, Cherrylyn P."}]}},{"research_paper":{"title":"Biomedical Engineering: Innovations in Prosthetics","content":"Examining recent innovations in prosthetics within the field of biomedical engineering, focusing on improving functionality and user experience.","abstract":"A comprehensive review of advancements in prosthetic technologies, discussing their impact on the lives of individuals with limb loss.","file":"/path/to/file69.pdf","date_publish":"2022-08-18","authors":[{"name":"Doromal, Roberto B."}]}},{"research_paper":{"title":"Climate Resilient Urban Planning","content":"Exploring strategies for climate-resilient urban planning, addressing the impact of climate change on cities and proposing adaptive solutions.","abstract":"An in-depth study on urban planning approaches to enhance resilience against the effects of climate change, ensuring sustainable development.","file":"/path/to/file70.pdf","date_publish":"2022-03-30","authors":[{"name":"Bulawit, Berna A."}]}},{"research_paper":{"title":"Digital Forensics in Cybersecurity Investigations","content":"Investigating the role of digital forensics in cybersecurity investigations, exploring techniques for analyzing and mitigating cyber threats.","abstract":"An overview of digital forensics methods, tools, and challenges in the context of cybersecurity, ensuring effective incident response and prevention.","file":"/path/to/file71.pdf","date_publish":"2022-06-12","authors":[{"name":"Gatchalian, Irynne P."}]}},{"research_paper":{"title":"Human-Robot Collaboration in Manufacturing","content":"Examining the advancements in human-robot collaboration within manufacturing processes, focusing on efficiency and safety improvements.","abstract":"A comprehensive review of the integration of robots alongside human workers in manufacturing, discussing benefits and challenges.","file":"/path/to/file72.pdf","date_publish":"2022-01-15","authors":[{"name":"Morales, Sheryl R."}]}},{"research_paper":{"title":"Advancements in Neurological Rehabilitation Technologies","content":"Investigating recent technological advancements in neurological rehabilitation, improving therapy outcomes for individuals with neurological disorders.","abstract":"A comprehensive study on innovative technologies and their impact on neurological rehabilitation, addressing challenges and opportunities.","file":"/path/to/file73.pdf","date_publish":"2022-11-08","authors":[{"name":"Smith, Jane ."}]}},{"research_paper":{"title":"Digital Transformation in Healthcare: Patient-Centric Approaches","content":"Examining the implementation of digital transformation in healthcare, with a focus on patient-centric approaches for improved care delivery.","abstract":"An in-depth analysis of the impact of digital transformation on healthcare services, discussing challenges and best practices for patient-centered care.","file":"/path/to/file74.pdf","date_publish":"2022-02-20","authors":[{"name":"Aquino, Rodolfo Y."}]}},{"research_paper":{"title":"Green Building Technologies: Sustainable Construction Practices","content":"Investigating the use of green building technologies to promote sustainable construction practices, addressing environmental impact and energy efficiency.","abstract":"A comprehensive review of green building technologies, discussing their applications and benefits in achieving sustainable and energy-efficient buildings.","file":"/path/to/file75.pdf","date_publish":"2022-05-20","authors":[{"name":"Bactasa, Melanie F."}]}},{"research_paper":{"title":"Remote Sensing Applications in Agriculture","content":"Examining the use of remote sensing technologies for agricultural monitoring and management, optimizing crop yields and resource utilization.","abstract":"A comprehensive review of remote sensing applications in agriculture, discussing their impact on precision farming and sustainable practices.","file":"/path/to/file76.pdf","date_publish":"2021-04-15","authors":[{"name":"Gabasa, Asuncion V."}]}},{"research_paper":{"title":"Machine Learning for Predictive Maintenance in Industrial Systems","content":"Investigating the use of machine learning algorithms for predictive maintenance in industrial systems, optimizing equipment reliability and performance.","abstract":"An in-depth study on the applications and benefits of machine learning in predictive maintenance, reducing downtime and maintenance costs.","file":"/path/to/file77.pdf","date_publish":"2021-07-22","authors":[{"name":"Gatan, Leslie O."}]}},{"research_paper":{"title":"Augmented Reality for Enhanced Learning Experiences","content":"Examining the applications of augmented reality in educational settings, enhancing learning experiences and student engagement.","abstract":"A comprehensive review of augmented reality in education, discussing its potential to revolutionize teaching methods and improve learning outcomes.","file":"/path/to/file78.pdf","date_publish":"2021-10-10","authors":[{"name":"Monzon, Kezaiah M."}]}},{"research_paper":{"title":"Smart Cities: IoT Integration for Urban Development","content":"Investigating the integration of Internet of Things (IoT) technologies in smart city initiatives, improving efficiency and sustainability.","abstract":"An overview of IoT applications in smart cities, discussing their role in enhancing urban living, resource management, and infrastructure development.","file":"/path/to/file79.pdf","date_publish":"2021-08-18","authors":[{"name":"Johnson, Robert ."}]}},{"research_paper":{"title":"Advancements in 3D Printing Technologies","content":"Examining recent advancements in 3D printing technologies, exploring applications in manufacturing, healthcare, and other industries.","abstract":"A comprehensive review of the latest developments in 3D printing, discussing their impact on innovation, prototyping, and personalized manufacturing.","file":"/path/to/file80.pdf","date_publish":"2021-03-30","authors":[{"name":"Avena, Ian E."}]}},{"research_paper":{"title":"Renewable Energy Integration in Smart Grids","content":"Examining the integration of renewable energy sources in smart grids, optimizing energy distribution, and enhancing grid resilience.","abstract":"A comprehensive study on the role of renewable energy in smart grid systems, addressing challenges and opportunities for sustainable energy integration.","file":"/path/to/file81.pdf","date_publish":"2023-04-15","authors":[{"name":"Cecogo, Nieva M."}]}},{"research_paper":{"title":"Human-AI Collaboration in Creative Industries","content":"Investigating the collaboration between humans and artificial intelligence in creative industries, exploring new forms of artistic expression.","abstract":"An in-depth study on the impact of AI on creativity in various artistic domains, discussing challenges and the evolving nature of creative processes.","file":"/path/to/file82.pdf","date_publish":"2023-07-22","authors":[{"name":"Cipriano, Erwin S."}]}},{"research_paper":{"title":"Sustainable Transportation: Electric Vehicles and Beyond","content":"Examining the role of electric vehicles (EVs) in achieving sustainable transportation, addressing environmental and economic considerations.","abstract":"An overview of the challenges and opportunities in adopting EVs for sustainable transportation, discussing the impact on energy consumption and emissions.","file":"/path/to/file83.pdf","date_publish":"2023-10-10","authors":[{"name":"Clenuar, Ricardo H."}]}},{"research_paper":{"title":"Ethical Considerations in AI-driven Biomedical Research","content":"Addressing ethical challenges in AI-driven biomedical research, discussing responsible practices and ensuring ethical use of AI in healthcare.","abstract":"An analysis of ethical considerations in the intersection of AI and biomedical research, emphasizing the importance of transparency and patient privacy.","file":"/path/to/file84.pdf","date_publish":"2023-05-05","authors":[{"name":"Domingo, Keinaz ."}]}},{"research_paper":{"title":"Smart Agriculture: IoT Applications for Precision Farming","content":"Investigating the applications of IoT in smart agriculture, optimizing farming practices for increased efficiency and sustainable resource use.","abstract":"A comprehensive review of IoT applications in agriculture, discussing precision farming techniques and their impact on crop yields and resource management.","file":"/path/to/file85.pdf","date_publish":"2023-03-30","authors":[{"name":"Doromal, Cherry M."}]}},{"research_paper":{"title":"Advancements in Neurological Rehabilitation Technologies","content":"Investigating recent technological advancements in neurological rehabilitation, improving therapy outcomes for individuals with neurological disorders.","abstract":"A comprehensive study on innovative technologies and their impact on neurological rehabilitation, addressing challenges and opportunities.","file":"/path/to/file86.pdf","date_publish":"2023-11-08","authors":[{"name":"Monzon, Demelyn E."}]}},{"research_paper":{"title":"Blockchain in Healthcare: Securing Patient Data","content":"Examining the use of blockchain technology to secure patient data in healthcare systems, ensuring privacy and integrity of medical information.","abstract":"An overview of blockchain applications in healthcare, discussing their role in improving data security, interoperability, and patient-centric care.","file":"/path/to/file87.pdf","date_publish":"2023-02-20","authors":[{"name":"Balatbat, Christian O."}]}},{"research_paper":{"title":"Biopharmaceutical Innovations for Cancer Treatment","content":"Investigating the latest biopharmaceutical innovations in cancer treatment, focusing on targeted therapies and personalized medicine approaches.","abstract":"A comprehensive review of advancements in biopharmaceuticals for cancer treatment, discussing their impact on efficacy and patient outcomes.","file":"/path/to/file88.pdf","date_publish":"2023-05-20","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Renewable Energy Integration in Smart Grids","content":"Examining the integration of renewable energy sources in smart grids, optimizing energy distribution, and enhancing grid resilience.","abstract":"A comprehensive study on the role of renewable energy in smart grid systems, addressing challenges and opportunities for sustainable energy integration.","file":"/path/to/file90.pdf","date_publish":"2023-09-05","authors":[{"name":"Cecogo, Nieva M."}]}},{"research_paper":{"title":"Future of Work: Remote Collaboration Technologies","content":"Examining the technologies shaping the future of remote collaboration in the workforce, addressing challenges and opportunities in the digital workplace.","abstract":"An in-depth study on the impact of remote collaboration technologies on the future of work, discussing trends and implications for organizations and employees.","file":"/path/to/file89.pdf","date_publish":"2023-01-15","authors":[{"name":"Caturay, Norberto V."}]}},{"research_paper":{"title":" TrabaHunt - Online Talent Acquisition System","content":"<p>-</p>","abstract":"<p>The TrabaHunt System will be crucial in discovering the employees who are crucial for accomplishing the business objective. Long-term benefits come from selecting the ideal individuals for positions inside the company, and using the system enhances the hiring procedure. For a company to determine whether a candidate is qualified for a particular position, the Online Talent Acquisition system acts as a portal for applicants to enter their credentials and backgrounds. They need to put their backgrounds that can sell them for possible companies. Employers can post job advertisements and/or directly contact applicants for open positions using this system. The system also accepts individuals in the agent category, who will work directly for the TrabaHunt company and be dispatched to other organizations as needed.<br><br>The purpose of utilizing the system's services is to enhance the firm's overall workforce, better utilize its resources for the benefit of the involved department and establish a connection between the organization in case a pool of people is ever required for project development. As long as the system is operational before the end of the semester, the team can finish the project.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_7Cyxp3752.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Government Financial Management Innovators Circle, Incorporation Web Portal Accounts Handling System (AHS)","content":"<p>-</p>","abstract":"<p>This paper contains project information about the development of the GFMIC, Inc Web-based System Portal. GFMIC, Inc., formerly EUC, used to be a non-stock and non-profit organization of professionals that provides financial management information systems. Their service included a membership system for the people who use eNGAS and e-Budget systems. In the current Government Financial Management Information Center (GFMIC, Inc.) they use ICT as a tool for modernization of their operations. In this project, their association is in need of a web portal as a connection with their clients as well as a tool for their employees. The developed system portal includes the modules: account registration, membership, eCertificate generation, event management system, etc. Majority of the procedures executed by the project team to develop the product is documented in this paper. Further development was needed to accomplish future tasks of the clients. It is stated in this document that some of the following system requirements were not met because of unplanned outcomes that the development team had gone through the development process.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_8QjLgo8m7.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"XGBoost AI","content":"<p>AI for predicting behavior</p>","abstract":"<p>AI for predicting behavior</p>","file":"https://ik.imagekit.io/mdhmumzsp/SINTAPRENEUR-CAPACITY-BUILDING-TRAINING-FOR-GRAIN-FOUNDATION-PWD-BENEFICIARIES-_Externally-Funded-Extension-project-Repaired_2_VZgYAO25p_zUUO1j2Ak_4wjS8oJW5.docx","date_publish":"2024-04-27","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"myPUPQC: A Self Student Service Portal Online Medical Services and Support System (OMSSS) Announcement System (ANNSYS)","content":"<p>-</p>","abstract":"<p>MyPUPQC is a self-service portal that provides students with access to all necessary resources. This capstone project focuses on the development of the Online Medical Services and Support System (OMSSS) and the Announcement System (ANNSYS) modules, which are crucial components of MyPUPQC. The OMSSS module manages appointments for consultations with medical services, including guidance counseling, dental consultation, and medical consultation. It stores personal information, medical history, immunization records, and medical logs to examine prior issues, providing a helpful way to keep track of a student's health. The ANNSYS module is responsible for providing quick and practical notice and announcements to all students who use MyPUPQC, particularly during disasters or emergencies. <br><br>To develop the system, the Agile Scrum Methodology was employed, and the team was given two weeks within each sprint to complete each job assigned by the scrum master. This allowed the team to stay on track and make the system successful. The project team included developers, QA testers, documentation analysts, and a project manager. <br><br>The project's findings show that all systems, including OMSSS and ANNSYS, perform well in terms of efficiency, reliability, productivity, and consistency. The project concluded that the MyPUPQC business cycle and process require modification to enhance the system's progress. This system's potential impact is that it will help students and the university to ease the life of the student in accessing information, resources, and services of the university, particularly during this pandemic. In the future, the project could be further developed and integrated with other university systems to enhance overall student services. </p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_aGug14WXl.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"myPUPQC: A Self Student Service Portal Electronic Venue Records for Scheduled Events and Reservation System (EVRSERS) Announcement System (ANNSYS)","content":"<p>-</p>","abstract":"<p>myPUPQC is a self-service portal that provides students with access to all necessary resources. This capstone project focuses on the development of the Electronic Venue Records for Scheduled Events and Reservation System (EVRSERS) and the Announcement System (ANNSYS) modules, which are crucial components of MyPUPQC. The EVRSERS module manages all reservations made by different academic organizations in PUPQC. This module aims to provide a systematic and efficient way of reserving venues in PUPQC for scheduled events. The ANNSYS module is responsible for providing quick and practical notice and announcements to all students who use MyPUPQC, particularly during disasters or emergencies.<br><br>To develop the system, the Agile Scrum Methodology was employed, and the team was given two weeks within each sprint to complete each job assigned by the scrum master. This allowed the team to stay on track and make the system successful. The project team included developers, QA testers, documentation analysts, and a project manager.<br><br>The project's findings show that all systems, including EVRSERS and ANNSYS, perform well in terms of efficiency, reliability, productivity, and consistency. The project concluded that the MyPUPQC business cycle and process require modification to enhance the system's progress. This system's potential impact is that it will help students and the university to ease the life of the student in accessing information, resources, and services of the university, particularly during this pandemic. In the future, the project could be further developed and integrated with other university systems to enhance overall student services.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_693Qw2avN.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"myPUPQC – Student Self Service Portal: Online Document Request and Tracking System (ODRTS) & Announcement System (ANNSYS)","content":"<p>-</p>","abstract":"<p>myPUPQC is a self-service portal that provides students with access to all necessary resources. This capstone project focuses on the development of the Online Document Request and Tracking System (ODRTS) and the Announcement System (ANNSYS) modules, which are crucial components of MyPUPQC. The ODRTS module is a system that manages all documentation requests made by PUP students, from PUP staff and beyond. This system allows students to make online requests for specific documents, reducing the need for face-to-face contact and saving time by transmitting the request through the system. The ANNSYS module is responsible for providing quick and practical notice and announcements to all students who use MyPUPQC, particularly during disasters or emergencies. <br><br>To develop the system, the Agile Scrum Methodology was employed, and the team was given two weeks within each sprint to complete each job assigned by the scrum master. This allowed the team to stay on track and make the system successful. The project team included developers, QA testers, documentation analysts, and a project manager. <br><br>The project's findings show that all systems, including ODRTS and ANNSYS, perform well in terms of efficiency, reliability, productivity, and consistency. The project concluded that the MyPUPQC business cycle and process require modification to enhance the system's progress. This system's potential impact is that it will help students and the university to ease the life of the student in accessing information, resources, and services of the university, particularly during this pandemic. In the future, the project could be further developed and integrated with other university systems to enhance overall student services.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_VttMc6HNE.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"BITBo-iHealth: Barangay Management System","content":"<p>-</p>","abstract":"<p>BitBo &amp; iHealth: Barangay Management System is a web-based app intended to be used in Barangay. The system will automate the barangay's operations and transactions. It will eliminate every issue and mistake the manual process had. Through the use of iHealth, the people in the barangay can now be able to schedule appointments especially for their health-related concerns such as vaccination, clinic, dental clinic, medicine pick up and other health services including checkups and consultations. Because of the traditional manual processing of records in most barangays which is inefficient and vulnerable to human error, the suggested system must suit the demands of the target beneficiaries. <br><br>Overall, iHealth plays an important role in fostering health equity and ensuring that all members of the community, regardless of socioeconomic level or geographic location, have access to essential health services and information.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_ga8X4NbYu.pdf","date_publish":"2024-04-18","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"PSUCCESS Membership Management System","content":"<p>-</p>","abstract":"<p>PSUCCESS has emerged into a dynamic, proactive organization with rising memberships and comprehensive, relevant, and responsive programs. By developing a new and improved version of the PSUCCESS web system, it intends to replace the outdated website, make changes feasible with an admin feature that could manage contents and to remain an online knowledge hub for the community.<br><br>The goal is to re-engineer the organization’s previous website where it members and stakeholders can do their membership, join events and enroll themselves in the organization’s academy in order to actively contribute to enhancing the ICT skills of 21st century learners.<br><br>PSUCCESS Membership Management is one of the modules that PSUCCESS provides to its members. It oversees the user and institutional registration, account and institutional management, and membership system for PSUCCESS.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_-OieOMD-r.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"BITBo: A Barangay Management System","content":"<p>-</p>","abstract":"<p>The BITBo is a reliable, integrated, and automated system specially developed for barangays in the Philippines. This Capstone Project is mainly a Barangay Management System, a system for controlling work processes to decrease human error and processing time, increase productivity, produce goods of excellent quality, and lead to a properly integrated approach that performs significantly faster and more precise than the manual system.<br><br>This system provides users with an efficient working environment and generates more output. It provides a friendly user interface, knows every usability feature of the system, and prepares and prints barangay permits and certifications. It also processes fees such as barangay clearance fees and others and makes easy searching of records. Barangay residents can apply for their vaccination appointments and medicines/medical assistance. Further, it maintains an up-to-date register of residents for quick identification and updated references.<br><br>Agile Methodology was utilized to develop the system, and each task provided to the team by the scrum master had a two-week timeframe within each sprint. The team was able to maintain focus and successfully implement the needed modules and features in the system. Upon getting insights from various users, it was successfully performed and gave what it should provide after they analyzed the BITBo system's efficiency, reliability, productivity, and consistency among our respondents. The project could be developed and integrated for further innovation with other existing barangay systems to improve the overall barangay services.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_vSc9-2Um9.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"PSUCCESS Academy","content":"<p>-</p>","abstract":"<p>PSUCCESS has emerged into a dynamic, proactive organization with rising memberships and comprehensive, relevant, and responsive programs. By developing a new and improved version of the PSUCCESS web system, it intends to replace the outdated website, make changes feasible with an admin feature that could manage contents and to remain an online knowledge hub for the community.<br><br>The goal is to re-engineer the organization’s previous website where its members and stakeholders can do their membership, join events and enroll themselves in the organization’s academy in order to actively contribute to enhancing the ICT skills of 21st century learners.<br><br>PSUCCESS Academy is one of the modules that PSUCCESS provides to its members and the general public. It employs a learning platform to provide learners with the best possible learning experiences while also assisting educators in evaluating and tracking progress.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_J2tmUxpdV.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"PSUCCESS Event Management Module","content":"<p>-</p>","abstract":"<p>PSUCCESS has emerged into a dynamic, proactive organization with rising memberships and comprehensive, relevant, and responsive programs. By developing a new and improved version of the PSUCCESS web system, it intends to replace the outdated website, make changes feasible with an admin feature that could manage contents and to remain an online knowledge hub for the community.<br><br>The goal is to re-engineer the organization’s previous website where its members and stakeholders can do their membership, join events, and enroll themselves in the organization’s academy in order to actively contribute to enhancing the ICT skills of 21st century learners.<br><br>PSUCCESS Event Management Module is one of the modules that PSUCCESS provides to its members and the general public. This is where events are managed. Admin can set up events, manage attendees and provide certificates. This also allow members to join different events offered in the system.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_-WPJmqsWe.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Pandemic Toddlers Digital Learning and Development: The Working Moms' Survival Journey","content":"<p>-</p>","abstract":"<p>In times of the Covid-19 Pandemic, people experienced several lockdowns that lasted more than a week, sometimes months long. These moments are hard, especially with mothers that are working from their home and at the same time tending to their child’s needs academically with newly introduced online learning setups. This scenario during the pandemic placed mothers in a lot of strain mentally and physically. For that reason, this study developed a prototype android application that is intended to provide mothers with a possible substitute for teaching their young children the early education they need. This study also measured their knowledge and awareness regarding this activity online. The findings of our study determined that mothers that are exposed to the internet are somewhat encountered educational content for children. The mothers are quite satisfied after seeing the possible contents of the prototype application and how its contents are categorized for their children. In terms of development, the mothers are also quite satisfied with its overall set criteria. We concluded that this prototype application will provide help by enabling mothers to multitask a bit easier between tending to their children and work.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_LHv_XRFl4.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Pomo Do It: A Development of Web Application Productivity Tool","content":"<p>-</p>","abstract":"<p>Every day, students encounter many chores and responsibilities. school projects and house chores, no matter how numerous, it should be addressed and not to overlook. It is difficult to manage your time and tasks without a clear plan and without productivity tools to help you. The Pomodoro Technique is particularly beneficial because it allows you to effectively manage your time and focus on a work without distractions. It is also beneficial since it promotes discipline and task focused thinking. This strategy is intended to reduce multitasking and increase focus.<br><br>This paper proposed a web application productivity tool that gives students a new method to manage their time and tasks so that they may make the most of their day without wasting time and eliminate procrastination. The primary purpose of this study is to apply the Pomodoro Technique to a web application productivity tool that will be developed in PHP and using the SDLC Iterative Model, in which the researcher will carry out a small portion of the software until the best version of the prototype is achieved. The findings of the paper agree with prior studies indicating the Pomodoro Technique which will improve students’ productivity when applied properly and considerably.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_Z0_zo0_1Q.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"UTAC: Awareness on Mental Health Services: A Basis for Developing a One Stop Shop for Mental Health Needs","content":"<p>-</p>","abstract":"<p>Mental health remains a pressing but often overlooked concern in the Philippines, impacting the lives of millions of Filipinos. Recent studies reveal that suicide ranks as the second leading cause of death globally among individuals aged 15 to 29. This alarming statistic highlights the immediate need to address and prioritize mental health concerns within our society. Nonetheless, the stigma surrounding mental health persists. Additionally, patients still experience difficulties when trying to find and schedule appointments with mental health care providers, clinics, hospitals, and mental institutions due to the lack of available online information and services. This research project aims to tackle these problems by creating a user-friendly web application. This application will assist patients in discovering mental health care providers and institutions more easily. Unlike existing applications and systems that often focus on single features, our web application aims to provide a seamless and comprehensive user experience. The primary objective of this research is to enhance the user experience design and improve the accessibility of mental health services through the innovative use of technology. By providing a centralized hub for mental health resources, this web application seeks to bridge the information gap, reduce the stigma surrounding mental health, and ultimately contribute to improved mental well-being for the people of the Philippines.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_U3fGoAkjj.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Road Students’ Financial Behavior as Basis for The Development of a Personal Finance Management Application ","content":"<p>-</p>","abstract":"<p>Financial strain is found to be one of the primary stressors to students while they are in school. This is often the reason why students in the collegiate level choose to take up part time jobs to fund their studies as well as other expenditures and have been documented in higher educational institutions around the globe. However, considering the monetary amount that they earn, students barely have enough to save up money for future use. This is due to students often putting spending behaviors first due to being financially illiterate. Considering that problem, the researchers developed a financial management application which aims for users to improve their financial behavior. The study utilized a developmental and descriptive method of research to define the financial behavior of the students after using the application. The application had different intuitive features which helps the users in their financial situations and keep them on track of their saving record. The researchers surveyed about 100 employed and unemployed participants from Quezon City and Rizal regarding the application interface, experience, and satisfaction regarding the usage of the app. Overall, this study found out that users were satisfied with using the application and deemed it helpful in their financial management and could help users of different ages in terms of their personal finances.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_ku9xXNtk1.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"M-Learning: A Web Based Solution for Corresponding Students with Instant Messaging","content":"<p>-</p>","abstract":"<p>Amidst the challenges posed by the \"New Normal\" in education, a significant shift towards online and modular classes has occurred, impacting students, educators, and parents alike. A particular concern has arisen among modular learning students regarding the timely delivery of course materials. In response, educational institutions and instructors have embraced a variety of platforms to facilitate effective learning.<br>This research presents M-Learning, a web-based system developed to enhance the learning experience and foster improved communication. Employing purposive sampling, this study assesses correspondence student satisfaction among those enrolled at the Polytechnic University of the Philippines, Quezon City Branch, with a specific focus on aspects such as easy access to learning materials and better communication between instructors and students. The findings demonstrate the system's potential as an effective alternative for improving the learning environment for both students and instructors in correspondence mode.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_TSpwEw52Y.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"eRNA: The Implementation of Information Security Best Practices of non-SIS Records through Digitization and Process Improvement","content":"<p>-</p>","abstract":"<p>In the pursuit of modernizing and enhancing organizational services and business processes, the adoption of digital technology and the incorporation of information security best practices, along with process improvement, play significant roles. This study sought to determine the advantages and its benefits of introducing an electronic Records System for Non-Student Information System (SIS) Alumni, referred to as “eRNA”, within the context of Polytechnic University of the Philippines - Quezon City Branch. This initiative serves as a model for the effective implementation of information security best practices in managing non-SIS records through digitization and process improvement. <br><br>This was a combination of descriptive and developmental methods, according to a book entitled “A Guide to Managing Research” Descriptive research is “aimed at casting light on current issues or problems through a process of data collection that enables them to describe the situation more completely than was possible without employing this method.” (Fox &amp; Bayat, 2007). This method of research was used in the study to mainly focus on the design and development of the proposed system as the output of the study. Moreover,Quota and Purposive Sampling is the technique used to determine the number respondents of the study.<br><br>This study revealed that information security issues linked to the CIA triad are significant, with a strong correlation between organizational efficiency, data integrity, and performance based on data from students, alumni, and employees.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_fIDNzqMwJ.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"BHCAS: A Web-Developed Appointment System Using Time Slot Optimization Algorithm","content":"<p>-</p>","abstract":"<p>Access to high-quality healthcare is a basic human right for everyone. However, a lot of Filipinos couldn’t afford to have proper health care due to poverty, which is why various approaches have been proposed, including the use of technology to improve the delivery of healthcare services. By that, this research paper designed a barangay healthcare appointment system. The barangay healthcare appointment system is an innovative online platform that aims to simplify and optimize the process of scheduling medical appointments for residents of a barangay. It is designed to enhance access to healthcare services and improve the overall healthcare experience for the community. By providing a user-friendly interface, residents can easily book appointments with healthcare providers, receive timely reminders, and avoid long waiting times at healthcare facilities. The goal of the respective barangay healthcare appointment system is to make healthcare accessible to all residents, provide quick medical response, and promote a healthier and more vibrant community. In conclusion, the implementation of the barangay healthcare appointment system has resulted in a significant change in the community’s approach to the provision of healthcare services.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_r9PK3_jhG.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"StudOrg Performance Monitoring System: A Progressive Web App Using Fair Queuing Algorithm","content":"<p>-</p>","abstract":"<p>Managing a school organization can be challenging for students, administrators, and professors alike. The process of submitting paperwork for activities and waiting for approval from the university can be time consuming and frustrating. To address this issue, researchers have developed a progressive web application (PWA) to manage all activities related to the school organization. The StudOrg allows members to submit activities for approval, and administrators can review and approve or deny the activity. Additionally, the administrator can grade the activity and post it on the website for all members of the organization to see. Members can also submit links to documents or photos related to the event. The administrator can also generate reports to compare and evaluate the organization's activities. The StudOrg was developed using PHP and features a user-friendly interface designed using HTML and CSS. It is also mobile friendly, allowing students to access it without the need for a computer. To use the application, students must register and declare their organization affiliation. The proposed system aims to save time and manpower and reduce in-person contact during the Covid-19 pandemic.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_hSCy2P1Jy.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Cyber Security: Analysis of Mobile Network Vulnerability to SS7 Security Flaws","content":"<p>-</p>","abstract":"<p>Users often find it difficult to maintain internet security. In addition to the countless passwords, usernames, security questions, and URLs you need to remember, you also need to watch out for harmful software and applications. A recent episode of 60 Minutes featured a section on the security concerns around a mysterious but crucial backend technology for mobile networks. This technique is known as Signaling System Seven, or SS7. It plays a significant role in the overall security posture of mobile phones. In other words, SS7 would be the peg that the entire mobile security tower balances on if mobile security were a Jenga tower. <br><br>The peg in this situation is the worldwide network that links phone users and providers. With the help of SS7, phone networks may share data, calls, messages, and other types of communications. Additionally, it is the technology that enables roaming on other networks when a tourist is overseas and that enables banks to use geolocation to validate mobile payments. It plays a crucial yet understated role in our everyday lives in the mobile world of today. The issue is that anyone with access to someone's phone number (and a lot of knowledge) may utilize SS7 to easily intercept conversations and record messages. Additionally, SS7 attacks are exceedingly challenging to prevent; they can occur even when you adhere to security best practices.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_p4dnH-JEF.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"ComPass: A Contact Tracing Mobile Application for Barangay Commonwealth","content":"<p>-</p>","abstract":"<p>In 2020, the spread of viruses, especially COVID-19, stunned the world economy and infected millions of people around the globe. Millions of people suffer from the infection, and some of them die because of the disease. The health sectors around the globe come up with a solution to identify the route of transmission of the infectious disease. The establishments used a form to record the personal information of a person that went to the location of a certain place. But according to some articles and studies, the physical contact tracing forms have some issues. For example, the mishandling of the information that is stored may result in illegal activities. Due to the issues of physical contact tracing forms, the researchers came up with a solution that was secured, easy to use and understand. <br><br>Using contact tracing applications, the tracking of whereabouts of a certain person was easier and can be used by the public health sector to trace the transmission of the infectious COVID-19 and other viruses. The proposed contact tracing application was tested by the 30 random Polytechnic University of the Philippines students that are currently enrolled. According to the results, the majority of the respondents agree that the proposed contact tracing application was easy to use and it was more preferred than the physical contact tracing forms. The researchers recommend the use of the proposed contact tracing application to help the health sector for tracking the transmission of the disease and it encourages the future researchers to enhance and add more features to make the proposed contact tracing application more usable and innovative.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_hbggdgcN9.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"SalbaPH: Geographic Disaster System","content":"<p>-</p>","abstract":"<p>The Philippines is known to be a hotspot for natural disasters. Yearly, there is an average of 20 typhoons that enter the Philippine Area of Responsibility (PAR), 9 of which make landfall. SalbaPH is a web app designed to help disaster management by improving the coordination and tracking of individuals' locations during and after disasters. Survey data collected, using purposive sampling, highlighted the challenges during disasters, with respondents prioritizing coordination with response groups and location tracking. The majority of respondents expressed a desire to use an app for tracking people's locations for disaster preparedness, despite privacy concerns. The study also assessed SalbaPH's benefits and usability, revealing high user satisfaction with disaster planning, efficient response, family safety, and location services. However, concerns were raised regarding the reliability of the location sharing feature, emphasizing the need for improvements. This research underscores the system's potential benefits in disaster planning and response, aligning with increasing natural disasters. In conclusion, SalbaPH's development should prioritize reliability enhancements and user concerns, with recommendations for iterative development, scalability planning, stakeholder engagement, and user education.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_Mxx5O_-vf.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Implementation of Fisher-Yates Shuffle Algorithm (FYSA) to Learning Management System in Review Centers","content":"<p>-</p>","abstract":"<p>A learning management system is a software application or web-based technology used to deliver educational content and track learners' progress. The modernization brought about by this technology resulted to new, complicated ways for students to cheat or commit academic dishonesty. The review centers find it difficult to provide lessons online at the same time assess the knowledge of the students. The researchers developed an LMS that integrates the Fisher-Yates Shuffle Algorithm as a means to minimize academic dishonesty without wasting the mentors' time, money and effort. By implementing the LMS on the review center, the mentors collectively agree that it helped lessen the burden of tracking exam links and scores since the E-exam and LMS are both present in one platform and it also help them generate more accurate reports of the students' academic performance throughout the review sessions. The students also find the LMS helpful for their studies and they actively participate more due to the lectures uploaded and the systematic way of measuring their performance. This new, innovative way of providing interactive learning atmosphere ensuring that the students' assessments are accurate will help maintain the review centers' academic integrity and revolutionize the education system all around the world.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_ZnZIx-E3y.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Road Runners: A Driver Violation Tracker Mobile and Web Application powered by Quick Response Code","content":"<p>-</p>","abstract":"<p>Human errors are a normal problem in everyday life because they are inevitable and sometimes caused by an occurrence of a scenario. On public roads, this is also a usual phenomenon which arises behavioral changes to drivers, as well as to the enforcers and pedestrians. Excessive bad driving behaviors and experience poses great danger for public safety and damages to public properties. This paper investigated the possible sources that influence driving behaviors and what causes drivers to perform violations to the traffic law. Moreover, the agreement of the people with the traffic laws enforced on them were also examined. Various factors within the driving environment may have affected how drivers behave to certain scenarios they encounter on the road. The researchers developed a web application that tracks the violations and an android application capable of Quick Response Code (QR Code) features. The researchers have determined that the identified factors that influence driving behaviors rarely affect the respondents’ attitudes. In addition to this, it is possible that most drivers have are mindful of the consequences that will happen when they commit unlawful activities.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_14A30S_zm.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}},{"research_paper":{"title":"Pomo Do It: A Development of Web Application Productivity Tool","content":"<p>-</p>","abstract":"<p>Every day, students encounter many chores and responsibilities. school projects and house chores, no matter how numerous, it should be addressed and not to overlook. It is difficult to manage your time and tasks without a clear plan and without productivity tools to help you. The Pomodoro Technique is particularly beneficial because it allows you to effectively manage your time and focus on a work without distractions. It is also beneficial since it promotes discipline and task focused thinking. This strategy is intended to reduce multitasking and increase focus.<br><br>This paper proposed a web application productivity tool that gives students a new method to manage their time and tasks so that they may make the most of their day without wasting time and eliminate procrastination. The primary purpose of this study is to apply the Pomodoro Technique to a web application productivity tool that will be developed in PHP and using the SDLC Iterative Model, in which the researcher will carry out a small portion of the software until the best version of the prototype is achieved. The findings of the paper agree with prior studies indicating the Pomodoro Technique which will improve students’ productivity when applied properly and considerably.</p>","file":"https://ik.imagekit.io/mdhmumzsp/Test_qqYwtoEZX.pdf","date_publish":"2024-04-19","authors":[{"name":"Fernandez, Alma A."}]}}]